tap "1password/tap"
tap "ddev/ddev"
tap "felixkratz/formulae"
tap "homebrew/bundle"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "jesseduffield/lazydocker"
tap "jesseduffield/lazygit"
tap "koekeishiya/formulae"
tap "mach-kernel/pkgs"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "oven-sh/bun"
tap "qmk/qmk"
tap "saulpw/vd"
tap "shivammathur/php"
tap "skiptools/skip"
tap "superbrothers/opener"
tap "vladdoster/formulae"
brew "glib"
brew "readline"
brew "openjdk"
brew "apktool"
brew "python@3.12"
brew "asciinema"
brew "autoconf"
brew "autoconf-archive"
brew "automake"
brew "awscli"
brew "ccache"
brew "cloc"
brew "cmake"
brew "libssh2"
brew "freetds"
brew "php"
brew "composer"
brew "coreutils"
brew "cppcheck"
brew "dbus"
brew "deno"
brew "dos2unix"
brew "elixir"
brew "elixir-ls"
brew "unbound"
brew "gnutls"
brew "emacs"
brew "eza"
brew "fd"
brew "openjpeg"
brew "ffmpeg"
brew "fish"
brew "fisher"
brew "python@3.11"
brew "fontforge"
brew "fzf"
brew "gcc"
brew "ghostscript"
brew "git"
brew "gnu-sed"
brew "gnupg"
brew "go"
brew "gopls"
brew "gradle"
brew "netpbm"
brew "graphviz"
brew "guile"
brew "htop"
brew "hyperfine"
brew "shared-mime-info"
brew "imagemagick"
brew "iperf"
brew "jdtls"
brew "jq"
brew "lazygit", args: ["HEAD"]
brew "libqalculate"
brew "llvm"
brew "lua-language-server"
brew "lzfse"
brew "mas"
brew "minisign"
brew "moreutils"
brew "mosh"
brew "msmtp"
brew "mutt"
brew "mysql-client"
brew "neovim", args: ["HEAD"]
brew "netcat"
brew "ninja"
brew "openconnect"
brew "openjdk@11"
brew "openjdk@17"
brew "openjdk@21", link: true
brew "pstree"
brew "pv"
brew "pyenv"
brew "python-tk@3.11"
brew "python-tk@3.12"
brew "qt@5"
brew "redis"
brew "ripgrep"
brew "ruff"
brew "ruff-lsp"
brew "rustup"
brew "shellcheck"
brew "sqlfluff"
brew "suricata"
brew "telnet"
brew "terraform"
brew "terraform-ls"
brew "tmux"
brew "tree"
brew "typescript-language-server"
brew "uv"
brew "vscode-langservers-extracted"
brew "wakeonlan"
brew "watch"
brew "web-ext"
brew "wget"
brew "x11vnc"
brew "yara"
brew "ykman"
brew "yq"
brew "felixkratz/formulae/borders", args: ["HEAD"]
brew "jesseduffield/lazydocker/lazydocker"
brew "mach-kernel/pkgs/launchk"
brew "oven-sh/bun/bun"
brew "qmk/qmk/qmk"
brew "saulpw/vd/visidata"
cask "1password"
cask "1password-cli@beta"
cask "alfred"
cask "alt-tab"
cask "android-commandlinetools"
cask "android-platform-tools"
cask "android-studio"
cask "authy"
cask "battle-net"
cask "bettertouchtool"
cask "clickup"
cask "crossover"
cask "curseforge"
cask "dbeaver-community"
cask "discord"
cask "docker"
cask "google-cloud-sdk"
cask "gpxsee"
cask "hammerspoon"
cask "inkscape"
cask "kextviewr"
cask "keycastr"
cask "launchcontrol"
cask "lulu"
cask "microsoft-auto-update"
cask "microsoft-excel"
cask "microsoft-powerpoint"
cask "microsoft-remote-desktop"
cask "microsoft-teams"
cask "microsoft-word"
cask "mono-mdk-for-visual-studio"
cask "neovide"
cask "obs"
cask "orbstack"
cask "powershell"
cask "prismlauncher"
cask "qmk-toolbox"
cask "quicklook-json"
cask "rectangle-pro"
cask "shortcat"
cask "slack"
cask "spotify"
cask "steam"
cask "syntax-highlight"
cask "tableplus"
cask "temurin@8"
cask "tunnelblick"
cask "vimari"
cask "visual-studio"
cask "visual-studio-code"
cask "vlc"
cask "vnc-viewer"
cask "wezterm@nightly"
cask "wireshark"
cask "xquartz"
cask "zoom"
mas "1Password for Safari", id: 1569813296
mas "Amphetamine", id: 937984704
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Night of the Full Moon", id: 1480322643
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Xcode", id: 497799835
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "vscodevim.vim"
