tap "1password/tap"
tap "felixkratz/formulae"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "jesseduffield/lazydocker"
tap "jesseduffield/lazygit"
tap "koekeishiya/formulae"
tap "mach-kernel/pkgs"
tap "saulpw/vd"
tap "shivammathur/php"
tap "superbrothers/opener"
brew "asciinema"
brew "awscli"
brew "glib"
brew "clipper", restart_service: true
brew "cloc"
brew "libssh2"
brew "freetds"
brew "php", link: false
brew "composer"
brew "coreutils"
brew "dbus"
brew "unbound"
brew "gnutls"
brew "emacs"
brew "exa"
brew "fd"
brew "openjpeg"
brew "ffmpeg"
brew "fish"
brew "fisher"
brew "fontforge"
brew "fzf"
brew "ghostscript"
brew "git"
brew "gnu-sed"
brew "gnupg"
brew "go"
brew "gopls"
brew "gradle"
brew "guile"
brew "htop"
brew "shared-mime-info"
brew "imagemagick"
brew "iperf"
brew "jq"
brew "lazygit", args: ["HEAD"]
brew "libqalculate"
brew "llvm"
brew "lzfse"
brew "mas"
brew "mosh"
brew "msmtp"
brew "mutt"
brew "mysql-client"
brew "neovim", args: ["HEAD"]
brew "netcat"
brew "netpbm"
brew "pstree"
brew "pv"
brew "pyenv"
brew "qt@5"
brew "redis"
brew "ripgrep"
brew "rustup-init"
brew "telnet"
brew "tmux"
brew "tree"
brew "watch"
brew "wget"
brew "x11vnc"
brew "ykman"
brew "yq"
brew "felixkratz/formulae/borders", args: ["HEAD"]
brew "jesseduffield/lazydocker/lazydocker"
brew "mach-kernel/pkgs/launchk"
brew "saulpw/vd/visidata"
brew "shivammathur/php/php@7.4", link: true
brew "superbrothers/opener/opener"
cask "1password"
cask "1password-cli"
cask "alfred"
cask "alt-tab"
cask "arc"
cask "authy"
cask "clickup"
cask "dbeaver-community"
cask "discord"
cask "google-cloud-sdk"
cask "gpxsee"
cask "inkscape"
cask "kextviewr"
cask "keycastr"
cask "launchcontrol"
cask "lulu"
cask "microsoft-auto-update"
cask "microsoft-remote-desktop"
cask "microsoft-teams"
cask "neovide"
cask "obs"
cask "powershell"
cask "quicklook-json"
cask "rectangle-pro"
cask "shortcat"
cask "slack"
cask "spotify"
cask "tableplus"
cask "tunnelblick"
cask "visual-studio-code"
cask "vlc"
cask "vnc-viewer"
cask "wezterm-nightly"
cask "zoom"
mas "Amphetamine", id: 937984704
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Night of the Full Moon", id: 1480322643
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Xcode", id: 497799835
