tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "jesseduffield/lazydocker"
tap "jesseduffield/lazygit"
tap "liamkearn/limelight"
brew "python@3.10"
brew "ansible"
brew "awscli"
brew "libssh2"
brew "freetds"
brew "php"
brew "composer"
brew "coreutils"
brew "dbus"
brew "guile"
brew "unbound"
brew "gnutls"
brew "emacs"
brew "exa"
brew "fd"
brew "fish", link: false
brew "fzf"
brew "openjpeg"
brew "ghostscript"
brew "git"
brew "glib"
brew "gradle"
brew "htop"
brew "python@3.9"
brew "shared-mime-info"
brew "imagemagick"
brew "iperf"
brew "jq"
brew "lazygit", args: ["HEAD"]
brew "mosh"
brew "neovim", args: ["HEAD"]
brew "netcat"
brew "ripgrep"
brew "telnet"
brew "tmux"
brew "wget"
brew "jesseduffield/lazydocker/lazydocker"
brew "liamkearn/limelight/limelight"
cask "alacritty"
cask "alfred"
cask "alt-tab"
cask "authy"
cask "clickup"
cask "dozer"
cask "easy-move-plus-resize"
cask "google-chrome"
cask "rectangle"
cask "shortcat"
cask "slack"
cask "soundflower"
cask "spotify"
cask "tableplus"
cask "tunnelblick"
cask "visual-studio-code"
cask "zoom"
