tap "1password/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "jesseduffield/lazydocker"
tap "jesseduffield/lazygit"
tap "koekeishiya/formulae"
tap "liamkearn/limelight"
tap "saulpw/vd"
tap "shivammathur/php"
tap "superbrothers/opener"
brew "ansible"
brew "python@3.10"
brew "asciinema"
brew "awscli"
brew "glib"
brew "clipper", restart_service: true
brew "cloc"
brew "libssh2"
brew "freetds"
brew "php"
brew "composer"
brew "coreutils"
brew "dbus"
brew "dog"
brew "unbound"
brew "gnutls"
brew "guile"
brew "emacs"
brew "exa"
brew "fd"
brew "openjpeg"
brew "ffmpeg"
brew "fish", link: false
brew "fzf"
brew "ghostscript"
brew "git"
brew "gnu-sed"
brew "gnupg"
brew "qt@5"
brew "gradle"
brew "htop"
brew "python@3.9"
brew "shared-mime-info"
brew "imagemagick"
brew "iperf"
brew "jq"
brew "lazygit", args: ["HEAD"]
brew "libqalculate"
brew "mas"
brew "mosh"
brew "mysql-client"
brew "neovim", args: ["HEAD"]
brew "netcat"
brew "netpbm"
brew "pstree"
brew "pyenv"
brew "redis"
brew "ripgrep"
brew "telnet"
brew "tmux"
brew "tree"
brew "watch"
brew "wget"
brew "x11vnc"
brew "ykman"
brew "jesseduffield/lazydocker/lazydocker"
brew "koekeishiya/formulae/yabai", args: ["HEAD"]
brew "shivammathur/php/php@7.4"
brew "superbrothers/opener/opener"
cask "1password-cli"
cask "alacritty"
cask "alfred"
cask "alt-tab"
cask "authy"
cask "chromium"
cask "clickup"
cask "dbeaver-community"
cask "dozer"
cask "google-cloud-sdk"
cask "kextviewr"
cask "microsoft-edge"
cask "microsoft-remote-desktop"
cask "microsoft-teams"
cask "microsoft-word"
cask "neovide"
cask "obs"
cask "powershell"
cask "quicklook-json"
cask "rectangle-pro"
cask "shortcat"
cask "slack"
cask "soundflower"
cask "spotify"
cask "tableplus"
cask "tunnelblick"
cask "visual-studio-code"
cask "vlc"
cask "vnc-viewer"
cask "zoom"
mas "Amphetamine", id: 937984704
mas "Xcode", id: 497799835
